Revit 2024 API
HostObjAttributes.SetCompoundStructure Method
Sets the compound structure of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetCompoundStructure(
	CompoundStructure compoundStructure
)
Visual Basic
Public Sub SetCompoundStructure ( _
	compoundStructure As CompoundStructure _
)
Visual C++
public:
void SetCompoundStructure(
	CompoundStructure^ compoundStructure
)
Parameters
compoundStructure
Type: Autodesk.Revit.DB.CompoundStructure
See Also
HostObjAttributes Class
Autodesk.Revit.DB Namespace